<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
   "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>TD5 : exercice 3</title>
<link rel="Stylesheet" href="../css/exoCSS1-4.css" type="text/css" />
</head>
<body>
<h1>Cours HTML &amp; CSS</h1>

<h2>HTML</h2>

<h3>Le squelette</h3>

<p>Le squelette est constitu&eacute; de 3 parties :</p>
<ol>
  <li>Le prologue (DOCTYPE)</li>
  <li>L'entête (&eacute;l&eacute;ment HEAD)</li>
  <li>Le contenu (&eacute;l&eacute;ment BODY)</li>
</ol>

<p>  Les &eacute;l&eacute;ments HEAD et BODY sont obligatoires et se trouvrent
regroup&eacute;s dans l'&eacute;l&eacute;ment HTML.
</p>

<h3>Les &eacute;l&eacute;ments de bloc</h3>

<p>Les &eacute;l&eacute;ments de bloc r&eacute;alisent des ruptures dans le flux du
document, ils sont pr&eacute;c&eacute;d&eacute;s et suivis d'un retour à la ligne.</p>

<h3>Les &eacute;l&eacute;ments int&eacute;gr&eacute;s</h3>

<p>Les &eacute;l&eacute;ments int&eacute;gr&eacute;s servent à marquer visuellement ou logiquement une partie du texte. Les plus utilis&eacute;s modifient la typographie : <b>gras,</b> <i>italique,</i> et <span class="souligne" >soulign&eacute;</span>.</p>

<h2>CSS</h2>

<p>Les Cascading Style Sheets (feuilles de style en cascade)
permettent de modifier le rendu visuel des pages HTML. Pour cela on
peut proc&eacute;der de plusieurs façons : en surchargeant le rendu par
d&eacute;faut des &eacute;l&eacute;ments, en d&eacute;finissant des classes d'&eacute;l&eacute;ments ayant un
rendu commun ou en d&eacute;finissant des styles ponctuels ne servant qu'une
fois dans un document. </p>
<h3>Les propri&eacute;t&eacute;s</h3>

<p>Chaque type de rendu modifiable est cod&eacute; sous la forme d'une propri&eacute;t&eacute;, par exemple la propri&eacute;t&eacute; <tt>color</tt> permet de d&eacute;finir la couleur des caract&egrave;res. La syntaxe à respecter pour d&eacute;finir une propri&eacute;t&eacute; de style est la suivantte :
</p>
<pre>propri&eacute;t&eacute; : valeur ;</pre>
<p>L'utilisation du point-virgule est indispensable pour cloturer la d&eacute;finition de la propri&eacute;t&eacute;. Notons &eacute;galement que certains propri&eacute;t&eacute;s n&eacute;cessitent l'utilisation d'une unit&eacute; de mesure avec la valeur, notamment les polices de caract&egrave;res, et les diff&eacute;rentes tailles modifiables.
</p>

<h3>Les propri&eacute;t&eacute;s de bloc</h3>

<p class="bloc">Le contenu de chaque &eacute;l&eacute;ment de bloc est constitu&eacute; de trois couches : le padding (espacement entre contenu et bordure, la bordure, et le margin (espacement entre la bordure et le bloc englobant. Ces propri&eacute;t&eacute;s sont illustr&eacute;s sur les divisions suivantes :</p>

<div id="id1">
<div>
division
</div>
&nbsp;&nbsp;<br />
</div>


<h3>La d&eacute;finition des css</h3>

<p>Les feuilles de styles css peuvent
être d&eacute;finie dans trois endroits diff&eacute;rents : directement dans le code
html en ajoutant un attribut <tt>style</tt> aux &eacute;l&eacute;ments concern&eacute;s, dans
l'entête du document à l'int&eacute;rieur de l'&eacute;l&eacute;ment STYLE ou dans un
fichier s&eacute;par&eacute; indiqu&eacute; dans l'entête. L'int&eacute;rêt de cette derni&egrave;re
m&eacute;thode est de pouvoir donner un style identique à plusieurs page web
(notion de charte graphique)</p>

<hr />
<address>dominique . fournier @ univ-lehavre . fr</address>
</body> </html>
